/*1. Юзер вводить 2 цілих числа x та y. Вивести на екран всі числа
 від x до y включно.


let x = prompt(`Ведить число X`)
let y = prompt(`Ведить число Y`)


let arr = [x, y]
alert(arr); */



/*2. Юзер вводить розмір масиву. Заповнити новостворений масив рандомними
 (ЦІЛИМИ) значеннями та порахувати їх середнє арифметичне. Вивести цей 
 масив на екран, та результат розрахунку.*/

 let arr = prompt(`Введить цифру`)
 new Array(arr);
 


  arr = Math.ceil(Math.random() * 100);

 
 

 console.log(typeof(arr))
 
